# encoding:utf-8


'''说明：
一些实际中需要查表的参数，
简化为通过近似成函数（一次、二次等）求得。

这里记录：可以表示为一次函数的 => 两个点的坐标
'''


'''
品质标记：
    E：高等品质
    Q：一般品质
    L：下等品质
'''

#齿轮的接触疲劳极限，直线求 sigma_Hlim

#正火处理的结构钢zj_[?](45钢（正火）)
Hzj_E = [150,475,200,502]
Hzj_Q = [150,345,200,395]
Hzj_L = [150,345,200,395]

#调质处理钢：碳钢tg_[?](45钢（调质）,40Cr（调质）)
Htg_E = [150,560,200,610]
Htg_Q = [150,500,200,555]
Htg_L = [150,425,200,490]

#渗碳淬火钢(20Cr（渗碳后淬火）,20CrMnTi（渗碳后淬火）)
Hscg_E = [1650,1650,1650]
Hscg_Q = [1500,1500,1500]
Hscg_L = [1300,1300,1300]



# 齿轮的弯曲疲劳极限

#正火处理的结构钢zj_[?](45钢（正火）)
Fzj_E = [150,410,200,450]
Fzj_Q = [150,280,200,320]
Fzj_Q = [150,280,200,320]

#调质处理钢：碳钢tg_[?](45钢（调质）,40Cr（调质）)
Ftg_E = [150,495,200,530]
Ftg_Q = [150,400,200,445]
Ftg_L = [150,280,200,310]

#渗碳淬火钢(20Cr（渗碳后淬火）,20CrMnTi（渗碳后淬火）)
Hscg_E = [930,930,930]
Hscg_Q = [830,830,830]
Hscg_L = [530,530,530]